## Assignment 01
### Junaid Ali Bhatti
### FA24-RCS-005

### Task 1

In [7]:
#Task 1.1
nums = [3, 5, 7, 8, 12]
cubes=[]
for a in nums:
    cubes.append(a**3)
cubes

[27, 125, 343, 512, 1728]

In [11]:
#Task 1.2
dict = {}
dict["parrot"]=2
dict["goat"]=4
dict['spider']=8
dict["crab"]=10
dict

{'parrot': 2, 'goat': 4, 'spider': 8, 'crab': 10}

In [24]:
#Task 1.3
print("---------------")
print("Animal\t","Legs")
print("---------------")
sum=0

for x,y in dict.items():
    print(x,"\t",y)
    sum=sum+y
    
print("---------------")
print("Total\t",sum)
print("---------------")

---------------
Animal	 Legs
---------------
parrot 	 2
goat 	 4
spider 	 8
crab 	 10
---------------
Total	 24
---------------

In [38]:
#Task 1.4
A = (3, 9, 4, [5, 6])
A[3][0]=8  #chaning value from 5 to 8.
A

(3, 9, 4, [8, 6])

In [39]:
#Task 1.5
del A

In [50]:
#Task 1.6
B = ('a', 'p', 'p', 'l','e')
sum=0
for a in B:
    if(a=='p'):
        sum=sum+1
print("No of Acurance of in B: ",sum)

No of Acurance of in B:  2

In [53]:
#Task 1.7
B.index('l')

3

### Task 2

In [54]:
import numpy as np

In [58]:
#Task 2.1
A=np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
A

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [60]:
#Task 2.2
b=A[:2,:2]
b

array([[1, 2],
       [5, 6]])

In [72]:
#Task 2.3
c=np.empty(A.shape)

In [73]:
#Task 2.4
z = np.array([1, 0, 1])
for i in range(A.shape[1]):
    c[:, i] = A[:, i] + z
c

array([[ 2.,  3.,  4.,  5.],
       [ 5.,  6.,  7.,  8.],
       [10., 11., 12., 13.]])

In [74]:
X = np.array([[1,2],[3,4]])
Y = np.array([[5,6],[7,8]])
v = np.array([9,10])

In [77]:
#Task 2.5
np.add(X,Y)

array([[ 6,  8],
       [10, 12]])

In [78]:
#Task 2.6
np.dot(X,Y)

array([[19, 22],
       [43, 50]])

In [79]:
#Task 2.7
np.sqrt(Y)

array([[2.23606798, 2.44948974],
       [2.64575131, 2.82842712]])

In [80]:
#Task 2.8
np.dot(X,v)

array([29, 67])

In [86]:
#Task 2.9
np.sum(X,axis=0)

array([4, 6])

### Task 3

In [89]:
#Task 3.1
def Compute(distance,time):
    return distance/time
#e.g
print("Velocity: ",Compute(10,2),"m/s")

Velocity:  5.0 m/s

In [91]:
#Task 3.2
even_num=[2,4,6,8,10,12]
def mul(even_num):
    prod=1
    for i in even_num:
        prod=prod*i
    return prod
print("Product of elemects of list: ",even_num," is: ",mul(even_num))

Product of elemects of list:  [2, 4, 6, 8, 10, 12]  is:  46080

### Task 4

In [96]:
import pandas as pd
data = {
    'C1': [1, 2, 3, 5, 5],
    'C2': [6, 7, 5, 4, 8],
    'C3': [7, 9, 8, 6, 5],
    'C4': [7, 5, 2, 8, 8]
}
df = pd.DataFrame(data)
df

   C1  C2  C3  C4
0   1   6   7   7
1   2   7   9   5
2   3   5   8   2
3   5   4   6   8
4   5   8   5   8

In [97]:
#Task 4.1
df.head(2)

   C1  C2  C3  C4
0   1   6   7   7
1   2   7   9   5

In [98]:
#Task 4.2
df['C2']

0    6
1    7
2    5
3    4
4    8
Name: C2, dtype: int64

In [99]:
#Task 4.3
df.rename(columns={'C3': 'B3'}, inplace=True)
df

   C1  C2  B3  C4
0   1   6   7   7
1   2   7   9   5
2   3   5   8   2
3   5   4   6   8
4   5   8   5   8

In [101]:
#Task 4.4 , 4.5
df['Sum'] = df.sum(axis=1)
df

   C1  C2  B3  C4  Sum
0   1   6   7   7   42
1   2   7   9   5   46
2   3   5   8   2   36
3   5   4   6   8   46
4   5   8   5   8   52

In [102]:
#Task 4.6
df1=pd.read_csv('hello_sample.csv')

In [103]:
#Task 4.7
df1

    Gender  F_Color     B_Month  Weight
0     Male    Black       March      77
1     Male      Red       March      72
2     Male    Black     October      53
3   Female     Blue    February      63
4     Male    black    October       80
5   Female    Black    december      97
6     Male   Orange      August      60
7   Female      Red   September      59
8     Male     Blue        July      60
9     Male     Blue         May      58
10  Female      Red    October       60
11    Male    Black   September      65
12    Male    Green    December      85
13    Male    Black       April      72
14    Male    Green    January       90
15    Male   Yellow   November       90
16    Male    Black      August      54
17    Male    Black     January      82
18    Male  Mustard   December       60
19  Female    Black    October       76
20    Male    Black   February       67
21    Male   Yellow       April      74
22    Male      Red  September       66

In [104]:
#Task 4.8
df1.tail(2)

   Gender F_Color     B_Month  Weight
21   Male  Yellow       April      74
22   Male     Red  September       66

In [105]:
#Task 4.9
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Gender   23 non-null     object
 1   F_Color  23 non-null     object
 2   B_Month  23 non-null     object
 3   Weight   23 non-null     int64
dtypes: int64(1), object(3)
memory usage: 868.0+ bytes

In [107]:
#Task 4.10
df1.shape

(23, 4)

In [108]:
#Task 4.11
df1.sort_values(by='Weight')

    Gender  F_Color     B_Month  Weight
2     Male    Black     October      53
16    Male    Black      August      54
9     Male     Blue         May      58
7   Female      Red   September      59
18    Male  Mustard   December       60
10  Female      Red    October       60
6     Male   Orange      August      60
8     Male     Blue        July      60
3   Female     Blue    February      63
11    Male    Black   September      65
22    Male      Red  September       66
20    Male    Black   February       67
13    Male    Black       April      72
1     Male      Red       March      72
21    Male   Yellow       April      74
19  Female    Black    October       76
0     Male    Black       March      77
4     Male    black    October       80
17    Male    Black     January      82
12    Male    Green    December      85
14    Male    Green    January       90
15    Male   Yellow   November       90
5   Female    Black    december      97

In [110]:
#Task 4.12
df1.isnull()

    Gender  F_Color  B_Month  Weight
0    False    False    False   False
1    False    False    False   False
2    False    False    False   False
3    False    False    False   False
4    False    False    False   False
5    False    False    False   False
6    False    False    False   False
7    False    False    False   False
8    False    False    False   False
9    False    False    False   False
10   False    False    False   False
11   False    False    False   False
12   False    False    False   False
13   False    False    False   False
14   False    False    False   False
15   False    False    False   False
16   False    False    False   False
17   False    False    False   False
18   False    False    False   False
19   False    False    False   False
20   False    False    False   False
21   False    False    False   False
22   False    False    False   False

In [111]:
df1.dropna()

    Gender  F_Color     B_Month  Weight
0     Male    Black       March      77
1     Male      Red       March      72
2     Male    Black     October      53
3   Female     Blue    February      63
4     Male    black    October       80
5   Female    Black    december      97
6     Male   Orange      August      60
7   Female      Red   September      59
8     Male     Blue        July      60
9     Male     Blue         May      58
10  Female      Red    October       60
11    Male    Black   September      65
12    Male    Green    December      85
13    Male    Black       April      72
14    Male    Green    January       90
15    Male   Yellow   November       90
16    Male    Black      August      54
17    Male    Black     January      82
18    Male  Mustard   December       60
19  Female    Black    October       76
20    Male    Black   February       67
21    Male   Yellow       April      74
22    Male      Red  September       66

##### No they did'nt make any changes as there are no null values